src/test/resources/perf/ab_results.log
➜  perf git:(develop) ✗ ab -p payload.json -T application/json -n 1000 -c 100 http://52.5.109.111:8080/vote/
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 52.5.109.111 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Apache-Coyote/1.1
Server Hostname:        52.5.109.111
Server Port:            8080

Document Path:          /vote/
Document Length:        7 bytes

Concurrency Level:      100
Time taken for tests:   10.050 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      209000 bytes
Total body sent:        186000
HTML transferred:       7000 bytes
Requests per second:    99.50 [#/sec] (mean)
Time per request:       1004.984 [ms] (mean)
Time per request:       10.050 [ms] (mean, across all concurrent requests)
Transfer rate:          20.31 [Kbytes/sec] received
                        18.07 kb/s sent
                        38.38 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      176  317  98.3    308    1232
Processing:   184  515 331.5    435    2417
Waiting:      184  473 180.3    429    1070
Total:        363  832 358.3    744    2661

Percentage of the requests served within a certain time (ms)
  50%    744
  66%    801
  75%    983
  80%   1079
  90%   1174
  95%   1234
  98%   2280
  99%   2499
 100%   2661 (longest request)

#######################################################################
Test 2 - Realizado a partir de uma banda maior de internet, que permite maior fuidez nos requests.
#######################################################################
~/temp/abtest  ab -p payload.json -T application/json -n 1000 -c 100 http://52.5.109.111:8080/vote/
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 52.5.109.111 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Apache-Coyote/1.1
Server Hostname:        52.5.109.111
Server Port:            8080

Document Path:          /vote/
Document Length:        7 bytes

Concurrency Level:      100
Time taken for tests:   3.411 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      209000 bytes
Total body sent:        186000
HTML transferred:       7000 bytes
Requests per second:    293.19 [#/sec] (mean)
Time per request:       341.078 [ms] (mean)
Time per request:       3.411 [ms] (mean, across all concurrent requests)
Transfer rate:          59.84 [Kbytes/sec] received
                        53.25 kb/s sent
                        113.09 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      152  156  34.3    154    1232
Processing:   153  166  32.5    156     326
Waiting:      152  166  32.4    155     325
Total:        305  322  49.0    310    1400

Percentage of the requests served within a certain time (ms)
  50%    310
  66%    312
  75%    315
  80%    318
  90%    340
  95%    389
  98%    473
  99%    478
 100%   1400 (longest request)